In [4]:
import pandas as pd
s1 = pd.Series([2,3,4,5])
s2 = pd.Series([6,7,3,4])
df1 = pd.DataFrame({"col1":s1,"col2":s2})

In [5]:
df1

   col1  col2
0     2     6
1     3     7
2     4     3
3     5     4

In [6]:
s1.iloc[0]

2

In [7]:
s1.iloc[3]

5

In [8]:
df1.loc[3]

col1    5
col2    4
Name: 3, dtype: int64

In [10]:
df1.loc[0]

col1    2
col2    6
Name: 0, dtype: int64

In [11]:
s1

0    2
1    3
2    4
3    5
dtype: int64

In [12]:
s1 + 5

0     7
1     8
2     9
3    10
dtype: int64

In [13]:
s1-3

0   -1
1    0
2    1
3    2
dtype: int64

In [14]:
s2*2

0    12
1    14
2     6
3     8
dtype: int64

In [15]:
df1

   col1  col2
0     2     6
1     3     7
2     4     3
3     5     4

In [16]:
df1.columns

Index(['col1', 'col2'], dtype='object')

In [17]:
df1.columns = ["first","second"]

In [18]:
df1

   first  second
0      2       6
1      3       7
2      4       3
3      5       4

In [20]:
import numpy as np
np.nan

nan

In [22]:
pd.isnull(np.nan)

True

In [27]:
df1["first"][4] = 8

In [28]:
df1

   first  second
0      2       6
1      3       7
2      4       3
3      5       4

In [29]:
len(df1.index)

4

In [34]:
df1.loc[len(df1.index)] = [8,np.nan]

In [35]:
df1

   first  second
0    2.0     6.0
1    3.0     7.0
2    4.0     3.0
3    5.0     4.0
4    8.0     8.0
5    8.0     NaN

In [36]:
df1.loc[6] = [9,np.nan]

In [37]:
df1

   first  second
0    2.0     6.0
1    3.0     7.0
2    4.0     3.0
3    5.0     4.0
4    8.0     8.0
5    8.0     NaN
6    9.0     NaN

In [38]:
df1.isnull()

   first  second
0  False   False
1  False   False
2  False   False
3  False   False
4  False   False
5  False    True
6  False    True

In [39]:
df1.index

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

In [45]:
df1.loc[len(df1.index)]=[10,10]

In [46]:
df1

   first  second
0    2.0     6.0
1    3.0     7.0
2    4.0     3.0
3    5.0     4.0
4    8.0     8.0
5    8.0     NaN
6    9.0     NaN
7   10.0    10.0

In [47]:
df1.loc[8] = [12,11]

In [48]:
df1

   first  second
0    2.0     6.0
1    3.0     7.0
2    4.0     3.0
3    5.0     4.0
4    8.0     8.0
5    8.0     NaN
6    9.0     NaN
7   10.0    10.0
8   12.0    11.0

In [49]:
df1.dropna()

   first  second
0    2.0     6.0
1    3.0     7.0
2    4.0     3.0
3    5.0     4.0
4    8.0     8.0
7   10.0    10.0
8   12.0    11.0

In [50]:
df1

   first  second
0    2.0     6.0
1    3.0     7.0
2    4.0     3.0
3    5.0     4.0
4    8.0     8.0
5    8.0     NaN
6    9.0     NaN
7   10.0    10.0
8   12.0    11.0

In [51]:
df2 = df1.dropna()

In [52]:
df2

   first  second
0    2.0     6.0
1    3.0     7.0
2    4.0     3.0
3    5.0     4.0
4    8.0     8.0
7   10.0    10.0
8   12.0    11.0

In [53]:
df1.fillna(0)

   first  second
0    2.0     6.0
1    3.0     7.0
2    4.0     3.0
3    5.0     4.0
4    8.0     8.0
5    8.0     0.0
6    9.0     0.0
7   10.0    10.0
8   12.0    11.0

In [54]:
df1

   first  second
0    2.0     6.0
1    3.0     7.0
2    4.0     3.0
3    5.0     4.0
4    8.0     8.0
5    8.0     NaN
6    9.0     NaN
7   10.0    10.0
8   12.0    11.0

In [55]:
df1.fillna(0,axis=0)

   first  second
0    2.0     6.0
1    3.0     7.0
2    4.0     3.0
3    5.0     4.0
4    8.0     8.0
5    8.0     0.0
6    9.0     0.0
7   10.0    10.0
8   12.0    11.0

In [ ]:
#concat and append